tutorials/incompressibleVoF/sloshingCylinder/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      dynamicMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

mover
{
    type            motionSolver;

    libs            ("libfvMotionSolvers.so");

    motionSolver    solidBody;

    select          all;

    solidBodyMotionFunction multiMotion;

    oscillation
    {
        solidBodyMotionFunction oscillatingLinearMotion;
        oscillatingLinearMotionCoeffs
        {
            amplitude     (0.1 0 0);
            omega         18.8945578;
        }
    }

    rotation
    {
        solidBodyMotionFunction  rotatingMotion;
        rotatingMotionCoeffs
        {
            origin        (0 0.02 0);
            axis          (0 0 1);
            omega         180 [rpm];
        }
    }
}


// ************************************************************************* //
